Enums/СервисыОбменаСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СервисыОбменаСБанками</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаявкиНаКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФинансоваяОтчетность</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/УниверсальныйОбменСБанкамиКлиентСерверПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура СертификатСоответствуетОтборуПриПодбореДляОрганизации(Сертификат, ПараметрыОтбора, Результат) Экспорт
	
	// Обязательные параметры Сервис, Организация.
	Если ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаКредит") Тогда
		ЗаявкиНаКредитКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	ИначеЕсли ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ФинансоваяОтчетность") Тогда
		ФинОтчетностьВБанкиКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура СертификатСоответствуетОтборуПриВыводеСтроки(Сертификат, ПараметрыОтбора, Результат) Экспорт
	
	// Обязательные параметры Сервис, Организация.
	Если ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаКредит") Тогда
		ЗаявкиНаКредитКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	ИначеЕсли ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ФинансоваяОтчетность") Тогда
		ФинОтчетностьВБанкиКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура СертификатСоответствуетОтборуПриВыбореСертификата(Сертификат, ПараметрыОтбора, Результат) Экспорт
	
	// Обязательные параметры Сервис, Организация.
	Если ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаКредит") Тогда
		ЗаявкиНаКредитКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	ИначеЕсли ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ФинансоваяОтчетность") Тогда
		ФинОтчетностьВБанкиКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура СертификатСоответствуетОтборуПередКриптооперацией(Сертификат, ПараметрыОтбора, Результат) Экспорт
	
	// Обязательные параметры Сервис, Организация.
	Если ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаКредит") Тогда
		ЗаявкиНаКредитКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	ИначеЕсли ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ФинансоваяОтчетность") Тогда
		ФинОтчетностьВБанкиКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
